# Week 04

1. SELECT * FROM data;

2. SELECT * FROM data LIMIT(10);
 
3. SELECT id FROM data;  //id 是 data 表的特定一列
 
4. SELECT COUNT(id) FROM data;
 
5. SELECT * FROM data WHERE id<1000 AND age>30;
 
6. SELECT id,COUNT(DISTINCT order_id) FROM table1 GROUP BY id;
 
7. SELECT * FROM table1 t1 INNER_JOIN table2 t2 ON t1.id = t2.id;
 
8. SELECT * FROM table1 UNION SELECT * FROM table2;
 
9. DELETE FROM table1 WHERE id=10;
 
10. ALTER TABLE table1 DROP COLUMN column_name;

In [2]:
# 1. SELECT * FROM data
import pandas as pd
pd.read_excel(r'test.xlsx')
pd.read_excel(r'test_sheet.xlsx', sheet_name = 0)
pd.read_csv(r'test.csv', nrows=5, encoding='utf-8')
pd.read_table(r'test.txt')

import pymysql
sql = 'SELECT * FROM GeekTest'
dbInfo = {
    'host': 'localhost',
    'port' : 3306,
    'user' : 'root',
    'password' : 'root1234',
    'db' : 'maoyan'
}
conn = pymysql.connect(
    host = dbInfo['host'],
    port = dbInfo['port'],
    user = dbInfo['user'],
    password = dbInfo['password'],
    db = dbInfo['db'],
    charset = 'utf8'
)
df = pd.read_sql(sql, conn)
df

    id      name  sex  age
0    1      Jone    1   20
1    2  Sherlock    0   35
2    3      Mark    1   40
3    4      Kate    0   18
4    5      Deny    1   20
5    6    Floria    0   35
6    7      Luck    1   40
7    8       Goo    0   18
8    9      Tony    1   30
9   10      Zork    0   23
10  11      Dodo    1   42
11  12        Pi    0   28

In [5]:
# 2. SELECT * FROM data LIMIT(10);
df.head(10)

   id      name  sex  age
0   1      Jone    1   20
1   2  Sherlock    0   35
2   3      Mark    1   40
3   4      Kate    0   18
4   5      Deny    1   20
5   6    Floria    0   35
6   7      Luck    1   40
7   8       Goo    0   18
8   9      Tony    1   30
9  10      Zork    0   23

In [6]:
# 3. SELECT id FROM data;
df['id']

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
Name: id, dtype: int64

In [7]:
# 4. SELECT COUNT(id) FROM data;
df['id'].count()

12

In [10]:
# 5. SELECT * FROM data WHERE id<1000 AND age>30;
df[ df['id'] < 5][ df['age'] > 30 ]

   id      name  sex  age
1   2  Sherlock    0   35
2   3      Mark    1   40

In [34]:
# 6. SELECT id,COUNT(DISTINCT order_id) FROM table1 GROUP BY id;
df.drop_duplicates('age')[[ 'id', 'age' ]].groupby('id').aggregate({ 'age': 'count' })

    age
id
1     1
2     1
3     1
4     1
9     1
10    1
11    1
12    1

In [3]:
# 7. SELECT * FROM table1 t1 INNER_JOIN table2 t2 ON t1.id = t2.id;
sql_movie = 'SELECT * FROM movie;'
df_movie = pd.read_sql(sql_movie, conn)
pd.merge(df, df_movie, how='inner', on='id')

,id,name,sex,age,title,link,content,file_tyle,time
0,1,Jone,1,20,test movie,http://test,喜剧,2020-12-12,test movie info
1,2,Sherlock,0,35,test2 movie,http://test,喜剧,2020-12-12,test2 movie info
2,3,Mark,1,40,test3 movie,http://test,喜剧,2020-12-12,test3 movie info
3,4,Kate,0,18,test11 movie,http://test,喜剧,2020-12-12,test movie info

In [6]:
# 8. SELECT * FROM table1 UNION SELECT * FROM table2;
pd.concat([ df, df_movie ], join='outer').drop_duplicates()

,id,name,sex,age,title,link,content,file_tyle,time
0,1,Jone,1.0,20.0,NaN,NaN,NaN,NaN,NaN
1,2,Sherlock,0.0,35.0,NaN,NaN,NaN,NaN,NaN
2,3,Mark,1.0,40.0,NaN,NaN,NaN,NaN,NaN
3,4,Kate,0.0,18.0,NaN,NaN,NaN,NaN,NaN
4,5,Deny,1.0,20.0,NaN,NaN,NaN,NaN,NaN
5,6,Floria,0.0,35.0,NaN,NaN,NaN,NaN,NaN
6,7,Luck,1.0,40.0,NaN,NaN,NaN,NaN,NaN
7,8,Goo,0.0,18.0,NaN,NaN,NaN,NaN,NaN
8,9,Tony,1.0,30.0,NaN,NaN,NaN,NaN,NaN
9,10,Zork,0.0,23.0,NaN,NaN,NaN,NaN,NaN
10,11,Dodo,1.0,42.0,NaN,NaN,NaN,NaN,NaN
11,12,Pi,0.0,28.0,NaN,NaN,NaN,NaN,NaN
0,1,NaN,NaN,NaN,test movie,http://test,喜剧,2020-12-12,test movie info
1,2,NaN,NaN,NaN,test2 movie,http://test,喜剧,2020-12-12,test2 movie info
2,3,NaN,NaN,NaN,test3 movie,http://test,喜剧,2020-12-12,test3 movie info
3,4,NaN,NaN,NaN,test11 movie,http://test,喜剧,2020-12-12,test movie info

In [32]:
# 9. DELETE FROM table1 WHERE id=10;
df[ df['id'] != 10 ]
# or
df.drop(df[ df['id'] == 10 ].index)

    id      name  sex  age
0    1      Jone    1   20
1    2  Sherlock    0   35
2    3      Mark    1   40
3    4      Kate    0   18
4    5      Deny    1   20
5    6    Floria    0   35
6    7      Luck    1   40
7    8       Goo    0   18
8    9      Tony    1   30
10  11      Dodo    1   42
11  12        Pi    0   28

In [28]:
# 10. ALTER TABLE table1 DROP COLUMN column_name;
df.drop('sex', axis=1)

    id      name  age
0    1      Jone   20
1    2  Sherlock   35
2    3      Mark   40
3    4      Kate   18
4    5      Deny   20
5    6    Floria   35
6    7      Luck   40
7    8       Goo   18
8    9      Tony   30
9   10      Zork   23
10  11      Dodo   42
11  12        Pi   28